InformationRegisters/СтатусыЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СтатусыЗадач</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Интерфейс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Интерфейсы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СтатусыЗадач/Ext/ManagerModule.bsl
Процедура НазначитьСтатусЗадачи(Задача) Экспорт
	
	Если Задача.Выполнена Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	СтатусыЗадач.Задача КАК Задача
			|ИЗ
			|	РегистрСведений.СтатусыЗадач КАК СтатусыЗадач
			|ГДЕ
			|	СтатусыЗадач.Задача = &Задача";
		
		Запрос.УстановитьПараметр("Задача", Задача);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			НаборЗаписей = РегистрыСведений.СтатусыЗадач.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Задача.Установить(Задача);
			
			НаборЗаписей.Записать();
			
		КонецЦикла;
		
		Возврат;
		
	КонецЕсли; 
	
	Если ТипЗнч(Задача) = Тип("ЗадачаСсылка.ИзменениеСтатусаГЧ") Тогда
	
		СоздатьСтатусИзменениеСтатусаГЧ(Задача);		
	
	КонецЕсли;
	

КонецПроцедуры

Процедура СоздатьСтатусИзменениеСтатусаГЧ(Задача)

	СтатусДляЗадачи = 3;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусыЗадач.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.СтатусыЗадач КАК СтатусыЗадач
		|ГДЕ
		|	СтатусыЗадач.Задача = &Задача
		|	И СтатусыЗадач.Интерфейс = ЗНАЧЕНИЕ(Справочник.Интерфейсы.Замер1)
		|	И СтатусыЗадач.Статус = &Статус";
	
	Запрос.УстановитьПараметр("Задача", Задача);
	Запрос.УстановитьПараметр("Статус", СтатусДляЗадачи);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат;
	КонецЦикла;
	
	ИнтерфейсыЗамер1 = Справочники.Интерфейсы.Замер1;
	
	МенеджерЗаписей = РегистрыСведений.СтатусыЗадач.СоздатьМенеджерЗаписи();
	МенеджерЗаписей.Задача 		= Задача;
	МенеджерЗаписей.Интерфейс 	= ИнтерфейсыЗамер1;
	
	МенеджерЗаписей.Прочитать();
	
	МенеджерЗаписей.Задача 		= Задача;
	МенеджерЗаписей.Интерфейс 	= ИнтерфейсыЗамер1;
	МенеджерЗаписей.Статус	= 	СтатусДляЗадачи;
	
	МенеджерЗаписей.Записать();

КонецПроцедуры
